FV2310/E_0403.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.4.3: AD: Lieferbeginn</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0403</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> LF</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Besteht zum Folgetag des in der Abmeldeanfrage genannten Termins ein Vertragsverhältnis für diese Marktlokation?<BR align="left"/>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Liegt dem LFA bereits eine bestätigte Netzabmeldung vor?<BR align="left"/>>];
    "A30" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A30</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Belieferung wurde zu dem angefragten Ter-min aus der Abmeldeanfrage bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.<BR align="left"/></FONT>>];
    "A31" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A31</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zustimmung der Abmeldeanfrage zum in der bereits versendeten Abmeldung (welche noch nicht beantwortet wurde) genannten Termin.<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Liegt in der Abmeldeanfrage der Transaktionsgrund Ein-/ Auszug (Umzug) vor?<BR align="left"/>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Ist der Kunde aus der Abmeldeanfrage identisch mit dem Kunden beim LFA?<BR align="left"/>>];
    "A32" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A32</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es handelt sich nicht um einen Einzug, da der Kun-de aus der Abmeldeanfrage identisch mit dem Kunden beim LFA ist.<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Hat der LFA Informationen darüber, dass sein Kunde nicht ausgezogen ist?<BR align="left"/>>];
    "A33" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A33</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der LFA hat die Information, dass der Kunde nicht ausgezogen ist.<BR align="left"/></FONT>>];
    "A34" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A34</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung <BR align="left"/>Der LFA beendet die Belieferung und teilt sein Lieferendedatum in der Antwort mit.<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Liegt in der Abmeldeanfrage der Transaktionsgrund Wechsel vor?<BR align="left"/>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Bleibt das Vertragsverhältnis des LFA mit dem Kunden an dieser Marktlokation zum Tag nach dem Endedatum aus der Abmeldeanfrage bestehen?<BR align="left"/>>];
    "A35" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A35</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es besteht eine Vertragsbindung.<BR align="left"/></FONT>>];
    "A36" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A36</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Vertragsverhältnis wurde zum angefragten oder davor liegenden Termin beendet.<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Befindet sich die Marktlokation zum Folgetag des Endedatums aus der Abmeldeanfrage in der Ersatz-versorgung?<BR align="left"/>>];
    "A37" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A37</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Marktlokation befindet sich nicht in der Ersatzversorgung.<BR align="left"/></FONT>>];
    "A38" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A38</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Ersatzversorgung wurde zum angefragten Termin beendet.<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "3" [label="Ja"];
    "1" -> "2" [label="Nein"];
    "2" -> "A30" [label="Ja"];
    "2" -> "A31" [label="Nein"];
    "3" -> "6" [label="Nein"];
    "3" -> "4" [label="Ja"];
    "4" -> "A32" [label="Ja"];
    "4" -> "5" [label="Nein"];
    "5" -> "A33" [label="Ja"];
    "5" -> "A34" [label="Nein"];
    "6" -> "8" [label="Nein"];
    "6" -> "7" [label="Ja"];
    "7" -> "A35" [label="Ja"];
    "7" -> "A36" [label="Nein"];
    "8" -> "A37" [label="Nein"];
    "8" -> "A38" [label="Ja"];

    bgcolor="transparent";
}
